{
 "class_name": "Functional",
 "config": {
  "name": "model",
  "layers": [
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      null,
      7
     ],
     "dtype": "float32",
     "sparse": false,
     "ragged": true,
     "name": "nodes"
    },
    "name": "nodes",
    "inbound_nodes": []
   },
   {
    "class_name": "InstanceMethod",
    "config": {
     "name": "input.merge_dims",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "merge_dims"
    },
    "name": "input.merge_dims",
    "inbound_nodes": [
     [
      "nodes",
      0,
      0,
      {
       "args": [
        0,
        1
       ],
       "kwargs": {}
      }
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization",
    "inbound_nodes": [
     [
      [
       "input.merge_dims",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "InstanceProperty",
    "config": {
     "name": "input.row_splits",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "row_splits"
    },
    "name": "input.row_splits",
    "inbound_nodes": [
     [
      "nodes",
      0,
      0,
      {}
     ]
    ]
   },
   {
    "class_name": "ClassMethod",
    "config": {
     "name": "tf.RaggedTensor.from_row_splits",
     "trainable": true,
     "dtype": "float32",
     "cls_symbol": "RaggedTensor",
     "method_name": "from_row_splits"
    },
    "name": "tf.RaggedTensor.from_row_splits",
    "inbound_nodes": [
     [
      [
       "batch_normalization",
       0,
       0,
       {
        "kwargs": {}
       }
      ],
      [
       "input.row_splits",
       0,
       0,
       {
        "kwargs": {}
       }
      ]
     ]
    ]
   },
   {
    "class_name": "InputLayer",
    "config": {
     "batch_input_shape": [
      null,
      null,
      4
     ],
     "dtype": "float32",
     "sparse": false,
     "ragged": true,
     "name": "coords"
    },
    "name": "coords",
    "inbound_nodes": []
   },
   {
    "class_name": "GetEdgeFeatures",
    "config": {
     "name": "get_edge_features",
     "trainable": true,
     "dtype": "float32",
     "next_neighbors": 16
    },
    "name": "get_edge_features",
    "inbound_nodes": [
     [
      [
       "tf.RaggedTensor.from_row_splits",
       0,
       0,
       {}
      ],
      [
       "coords",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Subtract",
    "config": {
     "name": "subtract",
     "trainable": true,
     "dtype": "float32"
    },
    "name": "subtract",
    "inbound_nodes": [
     [
      [
       "get_edge_features",
       0,
       0,
       {}
      ],
      [
       "get_edge_features",
       0,
       1,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Concatenate",
    "config": {
     "name": "concatenate",
     "trainable": true,
     "dtype": "float32",
     "axis": -1
    },
    "name": "concatenate",
    "inbound_nodes": [
     [
      [
       "get_edge_features",
       0,
       0,
       {}
      ],
      [
       "subtract",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense",
     "trainable": true,
     "dtype": "float32",
     "units": 64,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense",
    "inbound_nodes": [
     [
      [
       "concatenate",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_1",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_1",
    "inbound_nodes": [
     [
      [
       "dense",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation",
    "inbound_nodes": [
     [
      [
       "batch_normalization_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_1",
     "trainable": true,
     "dtype": "float32",
     "units": 64,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_1",
    "inbound_nodes": [
     [
      [
       "activation",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_2",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_2",
    "inbound_nodes": [
     [
      [
       "dense_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_1",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_1",
    "inbound_nodes": [
     [
      [
       "batch_normalization_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_2",
     "trainable": true,
     "dtype": "float32",
     "units": 64,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_2",
    "inbound_nodes": [
     [
      [
       "activation_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "InstanceMethod",
    "config": {
     "name": "input.merge_dims_1",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "merge_dims"
    },
    "name": "input.merge_dims_1",
    "inbound_nodes": [
     [
      "tf.RaggedTensor.from_row_splits",
      0,
      0,
      {
       "args": [
        0,
        1
       ],
       "kwargs": {}
      }
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_3",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_3",
    "inbound_nodes": [
     [
      [
       "dense_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_3",
     "trainable": true,
     "dtype": "float32",
     "units": 64,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_3",
    "inbound_nodes": [
     [
      [
       "input.merge_dims_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_2",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_2",
    "inbound_nodes": [
     [
      [
       "batch_normalization_3",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_4",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_4",
    "inbound_nodes": [
     [
      [
       "dense_3",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "TFOpLambda",
    "config": {
     "name": "tf.math.reduce_mean",
     "trainable": true,
     "dtype": "float32",
     "function": "math.reduce_mean"
    },
    "name": "tf.math.reduce_mean",
    "inbound_nodes": [
     [
      "activation_2",
      0,
      0,
      {
       "axis": -2,
       "keepdims": false
      }
     ]
    ]
   },
   {
    "class_name": "TFOpLambda",
    "config": {
     "name": "tf.__operators__.add",
     "trainable": true,
     "dtype": "float32",
     "function": "__operators__.add"
    },
    "name": "tf.__operators__.add",
    "inbound_nodes": [
     [
      "batch_normalization_4",
      0,
      0,
      {
       "y": [
        "tf.math.reduce_mean",
        0,
        0
       ],
       "name": null
      }
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_3",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_3",
    "inbound_nodes": [
     [
      [
       "tf.__operators__.add",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "InstanceProperty",
    "config": {
     "name": "input.row_splits_1",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "row_splits"
    },
    "name": "input.row_splits_1",
    "inbound_nodes": [
     [
      "tf.RaggedTensor.from_row_splits",
      0,
      0,
      {}
     ]
    ]
   },
   {
    "class_name": "ClassMethod",
    "config": {
     "name": "tf.RaggedTensor.from_row_splits_1",
     "trainable": true,
     "dtype": "float32",
     "cls_symbol": "RaggedTensor",
     "method_name": "from_row_splits"
    },
    "name": "tf.RaggedTensor.from_row_splits_1",
    "inbound_nodes": [
     [
      [
       "activation_3",
       0,
       0,
       {
        "kwargs": {}
       }
      ],
      [
       "input.row_splits_1",
       0,
       0,
       {
        "kwargs": {}
       }
      ]
     ]
    ]
   },
   {
    "class_name": "GetEdgeFeatures",
    "config": {
     "name": "get_edge_features_1",
     "trainable": true,
     "dtype": "float32",
     "next_neighbors": 16
    },
    "name": "get_edge_features_1",
    "inbound_nodes": [
     [
      [
       "tf.RaggedTensor.from_row_splits_1",
       0,
       0,
       {}
      ],
      [
       "tf.RaggedTensor.from_row_splits_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Subtract",
    "config": {
     "name": "subtract_1",
     "trainable": true,
     "dtype": "float32"
    },
    "name": "subtract_1",
    "inbound_nodes": [
     [
      [
       "get_edge_features_1",
       0,
       0,
       {}
      ],
      [
       "get_edge_features_1",
       0,
       1,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Concatenate",
    "config": {
     "name": "concatenate_1",
     "trainable": true,
     "dtype": "float32",
     "axis": -1
    },
    "name": "concatenate_1",
    "inbound_nodes": [
     [
      [
       "get_edge_features_1",
       0,
       0,
       {}
      ],
      [
       "subtract_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_4",
     "trainable": true,
     "dtype": "float32",
     "units": 128,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_4",
    "inbound_nodes": [
     [
      [
       "concatenate_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_5",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_5",
    "inbound_nodes": [
     [
      [
       "dense_4",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_4",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_4",
    "inbound_nodes": [
     [
      [
       "batch_normalization_5",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_5",
     "trainable": true,
     "dtype": "float32",
     "units": 128,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_5",
    "inbound_nodes": [
     [
      [
       "activation_4",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_6",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_6",
    "inbound_nodes": [
     [
      [
       "dense_5",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_5",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_5",
    "inbound_nodes": [
     [
      [
       "batch_normalization_6",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_6",
     "trainable": true,
     "dtype": "float32",
     "units": 128,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_6",
    "inbound_nodes": [
     [
      [
       "activation_5",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "InstanceMethod",
    "config": {
     "name": "input.merge_dims_2",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "merge_dims"
    },
    "name": "input.merge_dims_2",
    "inbound_nodes": [
     [
      "tf.RaggedTensor.from_row_splits_1",
      0,
      0,
      {
       "args": [
        0,
        1
       ],
       "kwargs": {}
      }
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_7",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_7",
    "inbound_nodes": [
     [
      [
       "dense_6",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_7",
     "trainable": true,
     "dtype": "float32",
     "units": 128,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_7",
    "inbound_nodes": [
     [
      [
       "input.merge_dims_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_6",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_6",
    "inbound_nodes": [
     [
      [
       "batch_normalization_7",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_8",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_8",
    "inbound_nodes": [
     [
      [
       "dense_7",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "TFOpLambda",
    "config": {
     "name": "tf.math.reduce_mean_1",
     "trainable": true,
     "dtype": "float32",
     "function": "math.reduce_mean"
    },
    "name": "tf.math.reduce_mean_1",
    "inbound_nodes": [
     [
      "activation_6",
      0,
      0,
      {
       "axis": -2,
       "keepdims": false
      }
     ]
    ]
   },
   {
    "class_name": "TFOpLambda",
    "config": {
     "name": "tf.__operators__.add_1",
     "trainable": true,
     "dtype": "float32",
     "function": "__operators__.add"
    },
    "name": "tf.__operators__.add_1",
    "inbound_nodes": [
     [
      "batch_normalization_8",
      0,
      0,
      {
       "y": [
        "tf.math.reduce_mean_1",
        0,
        0
       ],
       "name": null
      }
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_7",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_7",
    "inbound_nodes": [
     [
      [
       "tf.__operators__.add_1",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "InstanceProperty",
    "config": {
     "name": "input.row_splits_2",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "row_splits"
    },
    "name": "input.row_splits_2",
    "inbound_nodes": [
     [
      "tf.RaggedTensor.from_row_splits_1",
      0,
      0,
      {}
     ]
    ]
   },
   {
    "class_name": "ClassMethod",
    "config": {
     "name": "tf.RaggedTensor.from_row_splits_2",
     "trainable": true,
     "dtype": "float32",
     "cls_symbol": "RaggedTensor",
     "method_name": "from_row_splits"
    },
    "name": "tf.RaggedTensor.from_row_splits_2",
    "inbound_nodes": [
     [
      [
       "activation_7",
       0,
       0,
       {
        "kwargs": {}
       }
      ],
      [
       "input.row_splits_2",
       0,
       0,
       {
        "kwargs": {}
       }
      ]
     ]
    ]
   },
   {
    "class_name": "GetEdgeFeatures",
    "config": {
     "name": "get_edge_features_2",
     "trainable": true,
     "dtype": "float32",
     "next_neighbors": 16
    },
    "name": "get_edge_features_2",
    "inbound_nodes": [
     [
      [
       "tf.RaggedTensor.from_row_splits_2",
       0,
       0,
       {}
      ],
      [
       "tf.RaggedTensor.from_row_splits_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Subtract",
    "config": {
     "name": "subtract_2",
     "trainable": true,
     "dtype": "float32"
    },
    "name": "subtract_2",
    "inbound_nodes": [
     [
      [
       "get_edge_features_2",
       0,
       0,
       {}
      ],
      [
       "get_edge_features_2",
       0,
       1,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Concatenate",
    "config": {
     "name": "concatenate_2",
     "trainable": true,
     "dtype": "float32",
     "axis": -1
    },
    "name": "concatenate_2",
    "inbound_nodes": [
     [
      [
       "get_edge_features_2",
       0,
       0,
       {}
      ],
      [
       "subtract_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_8",
     "trainable": true,
     "dtype": "float32",
     "units": 256,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_8",
    "inbound_nodes": [
     [
      [
       "concatenate_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_9",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_9",
    "inbound_nodes": [
     [
      [
       "dense_8",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_8",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_8",
    "inbound_nodes": [
     [
      [
       "batch_normalization_9",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_9",
     "trainable": true,
     "dtype": "float32",
     "units": 256,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_9",
    "inbound_nodes": [
     [
      [
       "activation_8",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_10",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_10",
    "inbound_nodes": [
     [
      [
       "dense_9",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_9",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_9",
    "inbound_nodes": [
     [
      [
       "batch_normalization_10",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_10",
     "trainable": true,
     "dtype": "float32",
     "units": 256,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_10",
    "inbound_nodes": [
     [
      [
       "activation_9",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "InstanceMethod",
    "config": {
     "name": "input.merge_dims_3",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "merge_dims"
    },
    "name": "input.merge_dims_3",
    "inbound_nodes": [
     [
      "tf.RaggedTensor.from_row_splits_2",
      0,
      0,
      {
       "args": [
        0,
        1
       ],
       "kwargs": {}
      }
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_11",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      2
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_11",
    "inbound_nodes": [
     [
      [
       "dense_10",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "dense_11",
     "trainable": true,
     "dtype": "float32",
     "units": 256,
     "activation": "linear",
     "use_bias": false,
     "kernel_initializer": {
      "class_name": "GlorotUniform",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "dense_11",
    "inbound_nodes": [
     [
      [
       "input.merge_dims_3",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_10",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_10",
    "inbound_nodes": [
     [
      [
       "batch_normalization_11",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "BatchNormalization",
    "config": {
     "name": "batch_normalization_12",
     "trainable": true,
     "dtype": "float32",
     "axis": [
      1
     ],
     "momentum": 0.99,
     "epsilon": 0.001,
     "center": true,
     "scale": true,
     "beta_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "gamma_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "moving_mean_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "moving_variance_initializer": {
      "class_name": "Ones",
      "config": {}
     },
     "beta_regularizer": null,
     "gamma_regularizer": null,
     "beta_constraint": null,
     "gamma_constraint": null
    },
    "name": "batch_normalization_12",
    "inbound_nodes": [
     [
      [
       "dense_11",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "TFOpLambda",
    "config": {
     "name": "tf.math.reduce_mean_2",
     "trainable": true,
     "dtype": "float32",
     "function": "math.reduce_mean"
    },
    "name": "tf.math.reduce_mean_2",
    "inbound_nodes": [
     [
      "activation_10",
      0,
      0,
      {
       "axis": -2,
       "keepdims": false
      }
     ]
    ]
   },
   {
    "class_name": "TFOpLambda",
    "config": {
     "name": "tf.__operators__.add_2",
     "trainable": true,
     "dtype": "float32",
     "function": "__operators__.add"
    },
    "name": "tf.__operators__.add_2",
    "inbound_nodes": [
     [
      "batch_normalization_12",
      0,
      0,
      {
       "y": [
        "tf.math.reduce_mean_2",
        0,
        0
       ],
       "name": null
      }
     ]
    ]
   },
   {
    "class_name": "Activation",
    "config": {
     "name": "activation_11",
     "trainable": true,
     "dtype": "float32",
     "activation": "relu"
    },
    "name": "activation_11",
    "inbound_nodes": [
     [
      [
       "tf.__operators__.add_2",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "InstanceProperty",
    "config": {
     "name": "input.row_splits_3",
     "trainable": true,
     "dtype": "float32",
     "attr_name": "row_splits"
    },
    "name": "input.row_splits_3",
    "inbound_nodes": [
     [
      "tf.RaggedTensor.from_row_splits_2",
      0,
      0,
      {}
     ]
    ]
   },
   {
    "class_name": "ClassMethod",
    "config": {
     "name": "tf.RaggedTensor.from_row_splits_3",
     "trainable": true,
     "dtype": "float32",
     "cls_symbol": "RaggedTensor",
     "method_name": "from_row_splits"
    },
    "name": "tf.RaggedTensor.from_row_splits_3",
    "inbound_nodes": [
     [
      [
       "activation_11",
       0,
       0,
       {
        "kwargs": {}
       }
      ],
      [
       "input.row_splits_3",
       0,
       0,
       {
        "kwargs": {}
       }
      ]
     ]
    ]
   },
   {
    "class_name": "GlobalAveragePooling1D",
    "config": {
     "name": "global_average_pooling1d",
     "trainable": true,
     "dtype": "float32",
     "data_format": "channels_last",
     "keepdims": false
    },
    "name": "global_average_pooling1d",
    "inbound_nodes": [
     [
      [
       "tf.RaggedTensor.from_row_splits_3",
       0,
       0,
       {}
      ]
     ]
    ]
   },
   {
    "class_name": "Dense",
    "config": {
     "name": "ts_output",
     "trainable": true,
     "dtype": "float32",
     "units": 2,
     "activation": "softmax",
     "use_bias": true,
     "kernel_initializer": {
      "class_name": "HeNormal",
      "config": {
       "seed": null
      }
     },
     "bias_initializer": {
      "class_name": "Zeros",
      "config": {}
     },
     "kernel_regularizer": null,
     "bias_regularizer": null,
     "activity_regularizer": null,
     "kernel_constraint": null,
     "bias_constraint": null
    },
    "name": "ts_output",
    "inbound_nodes": [
     [
      [
       "global_average_pooling1d",
       0,
       0,
       {}
      ]
     ]
    ]
   }
  ],
  "input_layers": [
   [
    "nodes",
    0,
    0
   ],
   [
    "coords",
    0,
    0
   ]
  ],
  "output_layers": [
   [
    "ts_output",
    0,
    0
   ]
  ]
 },
 "keras_version": "2.7.0",
 "backend": "tensorflow"
}